#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//经典题☆
// 
//第1节 数据在内存中的存储
//重点：
//1.数据类型
//2.整型在内存中的存储：原反补码
//3.大小端字节序
//4.浮点型在内存中的存储

//int main()
//{
//	int a = 10;			//4	//0a 00 00 00	
//	float f = 10.0;		//4	//00 00 20 41 
//	short b = 10;		//2	//0a 00
//	short int c = 10;	//2	//0a 00
//	return 0;
//}

////整型家族
//char
//	unsigned char
//	signed char
//short 
//	unsigned short [int]
//	signed short [int]
//int 
//	unsigned int
//	signed int
//long
//	unsigned long [int]
//	signed long [int]

//浮点型家族
//float
//double
//
//构造类型
//数组类型	int arr[10]
//结构体类型	struct
//枚举类型	enum
//联合类型	union
//
//指针类型
//int*pi
//char*p
//float*p
//void*p	//空类型	无类型，函数返回、参数、指针

////代码
////无返回
//void test(void)
//{
//	printf("haomo.ai\n");
//}
//int main()
//{
//	test(100);
//	return 0;
//}

////代码
////整型在内存中的存储☆二进制序列的补码☆——CPU里面只有加法器
////原反补码：有符号数：原反补一样，负数不一样
//int main()
//{
//	int a = 16;	//10 00 00 00
//	int b = -1;	//ff ff ff ff 
//	//-1的原反补
//	//10000000 00000000 00000000 00000001 原
//	//11111111 11111111 11111111 11111110 反
//	//11111111 11111111 11111111 11111111 补 反+1，内存存的补码！
//	return 0;
//}

//代码
//int main()
//{
//	1 - 1;
//	1 + (-1);
//	//00000000 00000000 00000000 00000001	1原码
//	//10000000 00000000 00000000 00000001   -1原码
//	//11111111 11111111 11111111 11111111   -1补码
//	return 0;
//}

////大小端	大端字节序、小端字节序
////大端存储：数据低位保存在内存高地址中，而数据高位保存在内存低地址中；
////小端存储：数据低位保存在内存低地址中，而数据高位保存在内存高地址中。
//int main()
//{
//	int a = 0x11223344;
//	return 0;
//}
////当前机器，小端存储，和现实生活数字反过来，如10000元

//简述大端字节序、小端字节序的概念，设计一个小程序判断当前机器的字节序！
//数据高低位 内存高低地址
//int main()
//{
//	int a = 0x44332211;
//	char* p = &a;
//	if (*(p + 1) - *p > 0)//高位在高地址，小端
//		printf("当前机器：小端\n");
//	else
//		printf("当前机器：大端\n");
//	return 0;
//}


////当前机器字节序
////第1个字节是1，就是小端字节序
//int check_sys()
//{
//	int a = 1;
//	//返回1，小端
//	//返回0，大端
//	return *(char*)&a;;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}
//1.指针类型决定了指针解引用能访问的字节数；
//2.指针+1，-1跳过几个字节


////代码,原反补、整型提升
////☆
//#include<stdio.h>
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d b=%d c=%u\n", a, b, c);
//	return 0;
//}
////-1 -1 255
////10000000 00000000 00000000 00000001 -1
////11111111 11111111 11111111 11111111 补，全F
////
////1111 1111
//// 
////整型提升
////11111111 11111111 11111111 11111111 补，全F
////
////00000000 00000000 00000000 11111111 补


////代码
//#include<stdio.h>
//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//	printf("%d\n", a);
//
//	return 0;
//}
////ffffff80
////-128
//// 
//	%d 打印十进制有符号数
//	%u 打印十进制无符号数
// 
// 10000000 00000000 00000000 10000000
// 11111111 11111111 11111111 01111111
// 11111111 11111111 11111111 10000000	补
// 
// 10000000，整型提升
// 11111111 11111111 11111111 10000000，ffffff80	无符号
// 
// //4294967168
// 
// 11111111 11111111 11111111 01111111	反
// 10000000 00000000 00000000 10000000	原
// -128

//有符号char范围：-128-127
//无符号char范围：0-255
//0
//...
//127
//-128
//...
//-1

////127+1变128
//int main()
//{
//	char a = 127;
//	char b = a + 1;
//	printf("%u\n", b);
//	return 0;
//}
//
////若printf("%d\n", b)，有符号，则-128
////FFFFFF80
//
// 
// 
// //相等，打印hello
//int main()
//{
//	char a = -128;
//	char b = 128;
//	if (a == b)
//		printf("hello!");
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	return 0;
//}
////10000000 00000000 00000000 00010100 i原
////11111111 11111111 11111111 11101011 i反
////11111111 11111111 11111111 11101100 i补
////00000000 00000000 00000000 00001010 j补
////+
////11111111 11111111 11111111 11110110 补
////11111111 11111111 11111111 11110011 反
////10000000 00000000 00000000 00001100 -10
//

//main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}
////
//////死循环☆☆☆☆
//////-1超大数字

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
//
////-1 -2 -128 127 126 ... 0
////255

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}

//////死循环
//#include<stdio.h>
//#include<string.h>
//int main()
//{
//	char arr1[]= "abcde0abc";		//位置6，0
//	printf("%d\n", strlen(arr1));
//	printf("%s\n", arr1);	
//	char arr2[] = "abcde0abc";
//	arr2[2] =(char)0 ;
//	printf("%s\n", arr2);
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//数据范围，头文件有定义
//D:\ProgramFiles\vs2019\VC\Tools\MSVC\14.29.30133\include
//#include<limits.h>
//#include<float.h>

//整型、浮点型内存存储形式不一样
//参考IEEE 754规定
int main()
{
	//整型存入
	int n = 9;
	float* p = (float*)&n;
	//00000000 00000000 00000000 00001001	补码
	//0 00000000 000 0000000000 0000001001	按浮点数解读
	//(-1)^0 * 2^(1-127)*0.00000000000000000001001	
	printf("n的值 ：%d\n", n);	//9
	printf("*p的值：%f\n", *p);	//0.000000

	//浮点型存入
	*p = 9.0;
	//9.0
	//1001.0	二进制
	//1.001*2^3	指数变为3+127
	//0 10000010 001 0000000000 0000000000 内存存储值，电脑计算器可算为1091567616

	printf("n的值 ：%d\n", n);//1091567616
	printf("*p的值：%f\n", *p);//9.000000

	//举例1
	float f = -2.5;
	//-2.5
	//-10.1 二进制
	//-1.01 * 2^1	指数+127,变为128
	//1 10000000 010 0000000000 0000000000，内存存储值C0200000，可查内存也为000020c0小端，和计算的一致
	//
	return 0;
}



